Revit 2026 API

# ParametersOrder Enumeration

---

The order of the parameters.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ParametersOrder
```
```vb
Public Enumeration ParametersOrder
```
```cpp
public enum class ParametersOrder
```
```fsharp
type ParametersOrder
```

| Member name | Value | Description |
| --- | --- | --- |
| Ascending | 0 | Sort parameters are in ascending(A-Z) order. |
| Descending | 1 | Sort parameters are in descending(Z-A) order. |

#### Reference

Autodesk.Revit.DB Namespace